Merge pull request #43 from RHV-IT/feat/death-reporting
update docs
